zephyrproject-rtos/hal_infineon/dts/infineon/tc3x/tc37x-irq.h
#define IRQ_P21_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P21_1_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P21_1_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P21_2_TIM5_4 IRQ_GTM_TIM5_4
#define IRQ_P21_2_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P21_2_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P21_3_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P21_3_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P21_3_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P21_4_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P21_4_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P21_4_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P21_5_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P21_5_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P21_5_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P21_6_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P21_6_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P21_6_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P21_7_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P21_7_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P21_7_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P22_0_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P22_0_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P22_1_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P22_1_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P22_2_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P22_2_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P22_3_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P22_3_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P23_0_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P23_0_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P23_1_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P23_1_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P23_2_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P23_2_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P23_3_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P23_3_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P23_4_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P23_4_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P23_5_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P23_5_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P32_0_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P32_0_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P32_1_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P32_2_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P32_2_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P32_3_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P32_3_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P32_4_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P32_4_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P33_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P33_0_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P33_0_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P33_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P33_1_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P33_1_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P33_2_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P33_2_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P33_2_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P33_3_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P33_3_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P33_3_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P33_4_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P33_4_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P33_4_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P33_5_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P33_5_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P33_5_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P33_6_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P33_6_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P33_7_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P33_7_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P33_8_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P33_8_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P33_9_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P33_9_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P33_10_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P33_10_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P33_10_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P33_11_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P33_11_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P33_12_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P33_12_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P33_13_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P33_13_TIM2_1 IRQ_GTM_TIM2_1
#endif
